index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-11 Mon 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matias Eyzaguirre" />
</head>
<body>
<div id="content">
<h1 class="title">Git Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54f31bf">1. Caveat</a></li>
<li><a href="#orgad8a29a">2. <span class="todo TODO">TODO</span> Overview</a></li>
<li><a href="#orge25e0bc">3. <span class="todo TODO">TODO</span> Git</a></li>
<li><a href="#org4f49720">4. <span class="todo TODO">TODO</span> Github</a></li>
<li><a href="#org6fc185e">5. <span class="todo TODO">TODO</span> GitKraken</a></li>
<li><a href="#org1fb4036">6. <span class="todo TODO">TODO</span> Working with Others</a></li>
<li><a href="#orge9a95b7">7. Checklists</a>
<ul>
<li><a href="#orgf7c750a">7.1. Committing &amp; Pushing</a></li>
<li><a href="#orgbc996de">7.2. Making Pull Request</a></li>
<li><a href="#org4df7b0c">7.3. <span class="todo TODO">TODO</span> Pulling</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org54f31bf" class="outline-2">
<h2 id="org54f31bf"><span class="section-number-2">1</span> Caveat</h2>
<div class="outline-text-2" id="text-1">
<p>
A brief aside, none of this material is meant to be comprehensive. If there are
things you don't understand or seem incomplete then use your google fu. There's
a ton of good material that is going to be much better written and more
comprehensive than this.
</p>
</div>
</div>

<div id="outline-container-orgad8a29a" class="outline-2">
<h2 id="orgad8a29a"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Overview</h2>
<div class="outline-text-2" id="text-2">
<p>
You'll be using GitHub to host your repositories and to coordinate pull
requests, and you will be using GitKraken to interact with git. You May also
want to use some kind of diffing tool, such as Apple's FileMerge to help you
make sense of how your changes fit into everyone else's contributions.
</p>

<p>
You'll want to start by making a GitHub account, downloading GitKraken, and then
going through Krakens onboarding screens. After that you'll want to fork Tim's
repository on GitHub, clone your fork onto your development machine, and add
Tim's repo as your upstream remote.
</p>
</div>
</div>

<div id="outline-container-orge25e0bc" class="outline-2">
<h2 id="orge25e0bc"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Git</h2>
<div class="outline-text-2" id="text-3">
<p>
Git is a version control system that helps people keep track of the changes in
their code over time, as well as allowing multiple people to collaborate on the
same code base. It's made of fairly simple building blocks that can be put
together in many, sometimes complicated, ways. The problem space of keeping
track of contributions to a code base, coordinating and merging changes, and
even just answering the question "who touched these couple of lines last?" is
very large and pretty complicated. With very few exceptions, code is much more
complicated than a google doc.
</p>

<p>
Git is a command line program with many weird gotchas and complexities. Thus
many people use a GUI git client that lets them use git as a more friendly,
'traditional' application to smooth over these edges. While it is absolutely
worth your time to actually learn to use git from the terminal, and all it's
associated complexities, this is beyond the scope of my abilities. You'll have
to travel that path later in your programming career, unless you're feeling
particularly adventurous.
</p>
</div>
</div>

<div id="outline-container-org4f49720" class="outline-2">
<h2 id="org4f49720"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Github</h2>
</div>

<div id="outline-container-org6fc185e" class="outline-2">
<h2 id="org6fc185e"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> GitKraken</h2>
</div>

<div id="outline-container-org1fb4036" class="outline-2">
<h2 id="org1fb4036"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Working with Others</h2>
</div>

<div id="outline-container-orge9a95b7" class="outline-2">
<h2 id="orge9a95b7"><span class="section-number-2">7</span> Checklists</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgf7c750a" class="outline-3">
<h3 id="orgf7c750a"><span class="section-number-3">7.1</span> Committing &amp; Pushing</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>Save</li>
<li>Run your code to make sure it works</li>
<li>Run your test suite, make sure everything is green</li>
<li>Write a commit message (first line should be at most one sentence, more
detail goes on subsequent lines as needed)</li>
<li>Hit commit</li>
<li>(Optional) Realise that you misspelled one thing and hurridly make a
second commit fixing the issue. Repeat as needed.</li>
<li>Push your commit(s) to your repository on github.</li>
<li>Inform the group know that you've pushed something new.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbc996de" class="outline-3">
<h3 id="orgbc996de"><span class="section-number-3">7.2</span> Making Pull Request</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>Follow checklist for <a href="#orgf7c750a">7.1</a>.</li>
<li>Check one more time that the feature you've added works.</li>
<li>Create a new pull repuest.</li>
<li>Write an appropriate name and description.</li>
<li>Make sure Tim knows about the pull request.</li>
<li>Wait for him to review it.</li>
<li>Keep an eye on the requests discussion thread for comments from Tim or
the others.</li>
<li>In the event that a team member notices a problem with the request, make
any required changes and [[Commit &amp; Push] to your repository. Those changes
should be added to your pull request automatically.</li>
<li>Once your pull requested is accepted and merged, Tim will make sure
everyone is notified that they should [[Pull] from the main repository so
that your changes are distributed.</li>
</ol>
</div>
</div>

<div id="outline-container-org4df7b0c" class="outline-3">
<h3 id="org4df7b0c"><span class="section-number-3">7.3</span> <span class="todo TODO">TODO</span> Pulling</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Pulling is more delicate.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matias Eyzaguirre</p>
<p class="date">Created: 2019-11-11 Mon 16:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
